#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.os_password: Refreshing state... [id=none]
random_password.db_password: Refreshing state... [id=none]
random_string.random: Refreshing state... [id=80sp]
data.aws_route53_zone.opensearch: Reading...
data.aws_acm_certificate.opensearch: Reading...
aws_secretsmanager_secret.harbor_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:harbor-credentials-dev-thVaam]
aws_secretsmanager_secret.postgresql_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:dms-postgresql-credentials-dev-thVaam]
aws_secretsmanager_secret.azure_app_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:azure-app-credentials-dev-0vmFZu]
aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:eu-west-1:654654181948:cluster/dms-cluster-dev]
aws_secretsmanager_secret.backend_secret_key: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:backend-secret-key-dev-ZnomLp]
aws_kms_key.log_group_key: Refreshing state... [id=6aff413b-658e-4b1f-ac7f-08c7713fa2ad]
aws_secretsmanager_secret.opensearch_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:opensearch-creds-dev-rqqz1r]
data.aws_iam_policy_document.elasticsearch-log-publishing-policy: Reading...
data.aws_iam_policy_document.elasticsearch-log-publishing-policy: Read complete after 0s [id=2597252832]
aws_vpc.vpc: Refreshing state... [id=vpc-066ba78b0a176317d]
data.aws_route53_zone.opensearch: Read complete after 0s [id=Z0724547YPY8RPPKBNKT]
data.aws_caller_identity.current_account: Reading...
data.aws_caller_identity.current_account: Read complete after 0s [id=654654181948]
data.aws_iam_policy_document.ecs_task_role_policy: Reading...
data.aws_iam_policy_document.ecs_task_role_policy: Read complete after 0s [id=3789633034]
data.aws_iam_policy_document.ecs_task_execution_role_assume_role_policy: Reading...
data.aws_iam_policy_document.ecs_task_execution_role_assume_role_policy: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.ecs_task_role_assume_role_policy: Reading...
data.aws_iam_policy_document.ecs_task_role_assume_role_policy: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.get_secrets_policy: Reading...
data.aws_iam_policy_document.get_secrets_policy: Read complete after 0s [id=258835557]
aws_cloudwatch_log_resource_policy.elasticsearch-log-publishing-policy: Refreshing state... [id=elasticsearch-log-publishing-policy]
aws_iam_role.ecs_task_role: Refreshing state... [id=ecs-task-role-dev]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-task-execution-role-dev]
aws_secretsmanager_secret_version.azure_app_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:azure-app-credentials-dev-0vmFZu|AC3B7241-BC4A-4134-851D-83A08AFB541E]
aws_secretsmanager_secret_version.opensearch_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:opensearch-creds-dev-rqqz1r|8574CCAA-C2E7-4B75-934A-B9C846628EC4]
aws_secretsmanager_secret_version.harbor_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:harbor-credentials-dev-thVaam|51784D1A-0131-4B47-B2DA-FAEB4CB197EB]
aws_secretsmanager_secret_version.backend_secret_key: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:backend-secret-key-dev-ZnomLp|5032BA9A-341A-4AD8-9358-7A018CDCC5EA]
aws_ecs_cluster_capacity_providers.cluster: Refreshing state... [id=dms-cluster-dev]
aws_kms_key_policy.log_group_key_policy: Refreshing state... [id=6aff413b-658e-4b1f-ac7f-08c7713fa2ad]
aws_cloudwatch_log_group.opensearch_log_group_es_application_logs: Refreshing state... [id=/aws/es/dev20241205120702499500000005]
aws_cloudwatch_log_group.opensearch_log_group_index_slow_logs: Refreshing state... [id=/aws/es/dev20241205120702501700000007]
aws_cloudwatch_log_group.ecs_log_group: Refreshing state... [id=/aws/vendedlogs/states/ecs-dev-20250226144917531200000001]
aws_cloudwatch_log_group.opensearch_log_group_search_slow_logs: Refreshing state... [id=/aws/es/dev20241205120702500000000006]
aws_iam_role_policy_attachment.task_s3_access: Refreshing state... [id=ecs-task-role-dev-20250226144927510900000005]
aws_iam_role_policy.ecs_task_role_policy: Refreshing state... [id=ecs-task-role-dev:terraform-20250226144926922900000004]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=ecs-task-execution-role-dev-20250226144926358400000003]
data.aws_acm_certificate.opensearch: Read complete after 1s [id=arn:aws:acm:eu-west-1:654654181948:certificate/bc14494c-2be8-47c8-9ab4-e95e40b3d41f]
aws_iam_role_policy.password_policy_secretsmanager: Refreshing state... [id=ecs-task-execution-role-dev:dms-ecs-task-secretsmanager-dev]
data.aws_iam_policy_document.write_logs: Reading...
aws_ecs_task_definition.frontend: Refreshing state... [id=dms-frontend-dev]
data.aws_iam_policy_document.write_logs: Read complete after 0s [id=2464665302]
aws_iam_role_policy.write_logs: Refreshing state... [id=ecs-task-execution-role-dev:dms-ecs-task-write-logs-dev]
aws_security_group.frontend-alb: Refreshing state... [id=sg-013bd7e19655fc0ad]
aws_subnet.az1a: Refreshing state... [id=subnet-01ced75c7e6c8b205]
aws_security_group.dms-ecs: Refreshing state... [id=sg-068d351f926834e2b]
aws_lb_target_group.ecs_bg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:654654181948:targetgroup/ecs-target-group-backend-dev/d691ee372ad09133]
aws_subnet.az1c: Refreshing state... [id=subnet-0e73b97f14982576e]
aws_security_group.default: Refreshing state... [id=sg-05dcdb726243e4c1b]
aws_lb_target_group.ecs_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:654654181948:targetgroup/ecs-target-group-dev/c1f59309380a9370]
aws_subnet.az1b: Refreshing state... [id=subnet-0941597bf1abf3772]
aws_security_group.task: Refreshing state... [id=sg-0033dc5b44f1da192]
aws_security_group.backend-ecs: Refreshing state... [id=sg-0f805d63f7c0528a9]
aws_internet_gateway.vpc: Refreshing state... [id=igw-005132cfc3f9ed94c]
aws_security_group.dms-db: Refreshing state... [id=sg-09efffb1f8a3f63f0]
aws_security_group.frontend-ecs: Refreshing state... [id=sg-0652cd75378bc4733]
aws_vpc_security_group_egress_rule.allow_all_traffic_ipv4_task: Refreshing state... [id=sgr-08b39eadd227900ec]
aws_security_group.opensearch_security_group: Refreshing state... [id=sg-0ba5003931eb0e574]
aws_security_group.backend-alb: Refreshing state... [id=sg-0435547fcfa15b119]
aws_db_subnet_group.dms: Refreshing state... [id=postgres-dms-sn-group-dev]
aws_lb.ecs_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:654654181948:loadbalancer/app/ecs-alb-dev/e5d4f748bb71205c]
aws_route.igw: Refreshing state... [id=r-rtb-0d53d356605091e941080289494]
aws_opensearch_domain.opensearch: Refreshing state... [id=arn:aws:es:eu-west-1:654654181948:domain/dms-engine-dev]
aws_ecs_service.frontend_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:654654181948:service/dms-cluster-dev/frontend-service]
aws_route53_record.frontend: Refreshing state... [id=Z0724547YPY8RPPKBNKT_dev.deltares-fairdata.com_A]
aws_lb_listener.ecs_alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:654654181948:listener/app/ecs-alb-dev/e5d4f748bb71205c/d768de48b82bada4]
aws_db_instance.dms: Refreshing state... [id=db-6E6PWEVKSVCDFWQRXYYLPFPBKM]
aws_lb_listener_rule.backend_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:654654181948:listener-rule/app/ecs-alb-dev/e5d4f748bb71205c/d768de48b82bada4/44fcd30f129bf6e4]
aws_secretsmanager_secret_version.postgresql_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:654654181948:secret:dms-postgresql-credentials-dev-thVaam|D7C62A25-15C4-4870-9AD7-23D503DADC32]
aws_ecs_task_definition.backend: Refreshing state... [id=dms-backend-dev]
aws_ecs_service.backend_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:654654181948:service/dms-cluster-dev/backend-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_secretsmanager_secret_version.azure_app_credentials must be replaced
-/+ resource "aws_secretsmanager_secret_version" "azure_app_credentials" {
      ~ arn            = "arn:aws:secretsmanager:eu-west-1:654654181948:secret:azure-app-credentials-dev-0vmFZu" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:eu-west-1:654654181948:secret:azure-app-credentials-dev-0vmFZu|AC3B7241-BC4A-4134-851D-83A08AFB541E" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "AC3B7241-BC4A-4134-851D-83A08AFB541E" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.backend_secret_key must be replaced
-/+ resource "aws_secretsmanager_secret_version" "backend_secret_key" {
      ~ arn            = "arn:aws:secretsmanager:eu-west-1:654654181948:secret:backend-secret-key-dev-ZnomLp" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:eu-west-1:654654181948:secret:backend-secret-key-dev-ZnomLp|5032BA9A-341A-4AD8-9358-7A018CDCC5EA" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "5032BA9A-341A-4AD8-9358-7A018CDCC5EA" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @N-Clerkx, Action: `pull_request`, Working Directory: `./infra`, Workflow: `Terraform Infrastructure Change Management Pipeline with GitHub Actions`*